
#+BEGIN_SRC bash
fgrep -c -o “ *.raw > data.csv
#+END_SRC

#+BEGIN_SRC R :results output 
data <- read.csv("data.csv", sep=":", header = FALSE)
table(data$V2)
str(data)
#+END_SRC

#+RESULTS:
#+begin_example

   0    1    2    3    4    5    6    7    8    9   10   11   12   13   14   15 
4632 1059  496  326  182  138  116   84   71   63   51   39   34   37   26   32 
  16   17   18   19   20   21   22   23   24   25   26   27   28   29   30   31 
  24   22   16   14   12   17   11   11    8    9   14    8    5    4    4    3 
  32   33   34   35   36   37   38   39   40   41   42   43   44   45   46   47 
   3    7    3    6    3    1    3    4    2    3    2    2    4    2    5    2 
  48   49   50   51   53   56   57   58   59   60   61   62   63   64   65   66 
   3    1    2    2    2    1    1    1    4    2    2    1    3    1    3    3 
  67   68   70   73   78   79   80   82   88   89   94   95   98   99  103  107 
   1    1    2    2    1    2    1    1    1    1    1    1    1    1    2    1 
 120  122  125  127  128  132  135  163  186  192  204  214  276  765 
   1    1    2    1    1    1    1    1    1    1    1    1    1    1 
'data.frame':	7687 obs. of  2 variables:
 $ V1: Factor w/ 7687 levels "1.raw","10.raw",..: 1 2 3 4 5 6 7 8 9 10 ...
 $ V2: int  0 0 20 6 0 0 1 0 192 0 ...
#+end_example

We have 4632/7687 (~ 60%) arquivos não tem aspas. 

#+BEGIN_SRC R :results output 
data <- read.csv("data.csv", sep=":", header = FALSE)
tmp <- subset(data, V2 != 0)
tmp.1 <- hist(tmp$V2)
tmp.1
#+END_SRC

#+RESULTS:
#+begin_example
$breaks
 [1]   0  50 100 150 200 250 300 350 400 450 500 550 600 650 700 750 800

$counts
 [1] 2994   43   11    3    2    1    0    0    0    0    0    0    0    0    0
[16]    1

$density
 [1] 1.960065e-02 2.815057e-04 7.201309e-05 1.963993e-05 1.309329e-05
 [6] 6.546645e-06 0.000000e+00 0.000000e+00 0.000000e+00 0.000000e+00
[11] 0.000000e+00 0.000000e+00 0.000000e+00 0.000000e+00 0.000000e+00
[16] 6.546645e-06

$mids
 [1]  25  75 125 175 225 275 325 375 425 475 525 575 625 675 725 775

$xname
[1] "tmp$V2"

$equidist
[1] TRUE

attr(,"class")
[1] "histogram"
#+end_example

Temos 2994/7687 (38%) de arquivos de 0-50 aspas. Mas não sabemos o
comportamento destas aspas, podemos ter vários casos de uma ou poucas
palavras entre aspas. E poucos casos de blocos maiores, com sentenças,
entre aspas.

